{
    "id": "vehicles/hypercar",
    "title": "Buy a Hypercar",
    "description": "This car isn't just eye candy! It's also fully electric with a range of 500 miles and a suite of AI integrations, including a personal assistant and driving assistance",
    "image": "/assets/quests/hypercar.jpg",
    "npc": "/assets/npc/orion.jpg",
    "start": "start",
    "dialogue": [
        {
            "id": "start",
            "text": "Greetings, adventurer! I'm Orion, an electrical engineer with a passion for robotics and microprocessors. I specialize in designing and building intelligent robotic systems, including the Hypercar you see here. Are you interested in learning more about this marvel of modern engineering?",
            "options": [
                {
                    "type": "goto",
                    "goto": "moreinfo",
                    "text": "Definitely! Tell me more about the Hypercar."
                },
                {
                    "type": "goto",
                    "goto": "notinterested",
                    "text": "Not really, I'm just browsing."
                }
            ]
        },
        {
            "id": "moreinfo",
            "text": "The Hypercar is a fully electric vehicle with a range of 500 miles on a single charge. It's not only luxurious but also comes with a suite of AI integrations, including a personal assistant and advanced driving assistance. This car is a perfect blend of style, performance, and cutting-edge technology.",
            "options": [
                {
                    "type": "goto",
                    "goto": "howtobuy",
                    "text": "Sounds amazing! How can I buy one?"
                },
                {
                    "type": "goto",
                    "goto": "morequestions",
                    "text": "I have more questions about the Hypercar."
                }
            ]
        },
        {
            "id": "notinterested",
            "text": "No problem! If you change your mind or want to learn more about the Hypercar, feel free to come back anytime. Have a great day!",
            "options": [
                {
                    "type": "finish",
                    "text": "Thanks, Orion. Goodbye!"
                }
            ]
        },
        {
            "id": "howtobuy",
            "text": "To buy a Hypercar, you'll need to complete a series of tasks and gather the necessary resources. Once you've done that, you can place an order, and the Hypercar will be delivered to you. Are you ready to begin?",
            "options": [
                {
                    "type": "goto",
                    "goto": "acceptquest",
                    "text": "Absolutely! Let's get started."
                },
                {
                    "type": "goto",
                    "goto": "declinequest",
                    "text": "I'm not ready yet. I'll come back later."
                }
            ]
        },
        {
            "id": "morequestions",
            "text": "Of course! I'm here to answer any questions you have about the Hypercar. What would you like to know?",
            "options": [
                {
                    "type": "goto",
                    "goto": "howtobuy",
                    "text": "How can I buy a Hypercar?"
                },
                {
                    "type": "goto",
                    "goto": "notinterested",
                    "text": "I'm not interested anymore."
                }
            ]
        },
        {
            "id": "acceptquest",
            "text": "Fantastic! I'll guide you through the process of acquiring your very own Hypercar. Good luck!",
            "options": [
                {
                    "type": "finish",
                    "text": "Thank you, Orion. Let's do this!"
                }
            ]
        }
    ],
    "rewards": [],
    "requiresQuests": []
}