{
    "id": "rocketry/parachute",
    "title": "Add a parachute",
    "description": "The launch was a success, but let's improve the design for future launches. We'll add a parachute to ensure a safer landing and potential reuse.",
    "image": "/assets/quests/parachute.jpg",
    "npc": "/assets/npc/nova.jpg",
    "start": "start",
    "dialogue": [
        {
            "id": "start",
            "text": "Hey there! I hope you're still feeling the excitement from your first rocket launch! We've learned a lot, and now it's time to make some improvements. To ensure a safer landing, and potentially reuse the rocket for future launches, let's incorporate a parachute in the rocket design.",
            "options": [
                {
                    "type": "goto",
                    "goto": "parachute",
                    "text": "Sounds like a plan! How do we go about adding a parachute?"
                }
            ]
        },
        {
            "id": "parachute",
            "text": "Adding a parachute will help slow down the descent of the rocket, ensuring a gentler landing. This will increase the chances of a successful recovery and potential reuse of the rocket. We'll need a few extra components for this task: a parachute, shock cord, and recovery wadding. The recovery wadding safeguards the parachute from the ejection charge of the rocket motor. Once we have those items, we can proceed with the modifications.",
            "options": [
                {
                    "type": "process",
                    "process": "assemble-rocket-parachute",
                    "text": "Let's assemble the parachute system!"
                },
                {
                    "type": "goto",
                    "goto": "launch",
                    "text": "Great! Once the parachute system is ready, are we good to go for another launch?"
                }
            ]
        },
        {
            "id": "launch",
            "text": "Indeed! With the parachute system installed, we're ready for another launch. As before, place the rocket on the launchpad, insert the igniter, and connect the igniter to your launch controller. Once you're ready, press the launch button and watch the rocket take flight!",
            "options": [
                {
                    "type": "process",
                    "process": "launch-rocket-parachute",
                    "text": "This feels so exhilarating!!"
                },
                {
                    "type": "goto",
                    "goto": "success",
                    "requiresItems": [
                        {
                            "id": "40",
                            "count": 1
                        }
                    ],
                    "text": "Congratulations on another successful launch! How did the rocket fare with the parachute?"
                }
            ]
        },
        {
            "id": "success",
            "text": "The addition of the parachute worked like a charm, ensuring a safer landing for the rocket! It is a notable advancement from our previous attempt, and we're making great strides in rocketry!",
            "options": [
                {
                    "type": "finish",
                    "text": "Thank you, Nova! I'm thrilled with the progress we've made!"
                }
            ]
        }
    ],
    "rewards": [
        {
            "id": "4",
            "count": 1
        }
    ],
    "requiresQuests": [
    ]
}