{
    "about": {
        "title": "About",
        "sections": [
            {
                "title": "",
                "image": "/assets/logo.png",
                "components": [
                    {
                        "type": "text",
                    "content": "DSPACE is an incremental simulation game about resource management and space exploration. In the game, you'll learn skills, work on quests, and build your own presence in the solar system."
                    }
                ]
            },
            {
                "image": "/assets/thinking.jpg",
                "components": [
                    {
                        "type": "text",
                    "content": "The game is designed to be easy to pick up and play, with a gradual learning curve that will let you get the hang of the mechanics at your own pace."
                    }
                ]
            },
            {
                "title": "A work in progress",
                "components": [
                    {
                        "type": "text",
                        "content": "Whether you're looking for a casual game to idle, or a more in-depth experience to really sink your teeth into, DSPACE is sure to have something for you. The game is still very much under development. If you’d like to get involved in the creation of the game, please join the Discord server."
                    }
                ]
            },
            {
                "title": "Start with the basics",
                "components": [
                    {
                        "type": "text",
                        "content": "Learn skills related to space exploration and resource management, and be an early adopter of (virtual) futuristic tech."
                    }
                ]
            },
            {
                "title": "Gain momentum",
                "components": [
                    {
                        "type": "text",
                        "content": "Find a career related to the manufacturing of rockets, satellites, solar panels, and other space-related equipment. Or maybe you want to start a mining operation, or be a space pirate, or a space tourist. The choice is yours! Gain access to an existing launch provider or use your own rockets. Launch payloads into low Earth orbit. Create fuel depots. Explore the moon and beyond. Build your own space station."
                    }
                ]
            },
            {
                "title": "Make your own quests",
                "components": [
                    {
                        "type": "text",
                        "content": "Make your quests locally and then share them with the community. Each quest is reviewed by a human to ensure that it is not spammy or malicious. The quests will be soulbound ERC-1155 tokens minted for free, minus gas fees. Starting with Polygon. Participation is optional, but this feature is avaialble for those who are interested."
                    }
                ]
            }
        ]
    }
}