{
    "id": "welcome/howtodoquests",
    "title": "How to do quests",
    "description": "Learn how the quest mechanics work, including dialogue trees, items, and requirements.",
    "image": "/assets/quests/howtodoquests.png",
    "npc": "/assets/npc/tutorialnpc.jpg",
    "start": "start",
    "dialogue": [
        {
            "id": "start",
            "text": "Welcome to the 'How to do quests' tutorial! In this quest, you'll learn how quests work, including dialogue trees, items, and requirements. Are you ready to start?",
            "options": [
                {
                    "type": "goto",
                    "goto": "dialogue_trees",
                    "text": "Yes, let's begin!"
                },
                {
                    "type": "dismiss",
                    "text": "Not now, maybe later."
                }
            ]
        },
        {
            "id": "dialogue_trees",
            "text": "Quests consist of multiple trees of dialog. Each dialogue has a series of options, which lets you interactively navigate a maze of different quests and outcomes. When you finish a quest, you can optionally receive a list of items. Let's move on to learn about quest requirements.",
            "options": [
                {
                    "type": "goto",
                    "goto": "quest_requirements",
                    "text": "Continue"
                }
            ]
        },
        {
            "id": "quest_requirements",
            "text": "Certain quests require other quests to be completed before they can be started. This is done using a property called 'requiresQuests', which is a list. If there are no required quests, this list should be empty. Let's learn about item requirements now.",
            "options": [
                {
                    "type": "goto",
                    "goto": "item_requirements",
                    "text": "Continue"
                }
            ]
        },
        {
            "id": "item_requirements",
            "text": "You can require certain items to unlock certain options on a dialogue turn. For example, you might need 5 3D printers total to enable an option. To do this, you would include an 'itemsRequired' property in the option object. Finally, let's learn about process requirements.",
            "options": [
                {
                    "type": "goto",
                    "goto": "process_requirements",
                    "text": "Continue"
                }
            ]
        },
        {
            "id": "process_requirements",
            "text": "You can require certain processes to be complete before an option is available. Each option can have a 'processId' property filled, which might be something like 'outlet', '3dprint-rocket', etc. You've now learned the basics of how quests work!",
            "options": [
                {
                    "type": "finish",
                    "text": "Thanks for the tutorial!"
                }
            ]
        }
    ],
    "rewards": [],
    "requiresQuests": []
}
