{
    "id": "aquaria/goldfish",
    "title": "Set up an aquarium for a goldfish",
    "description": "Goldfish need a fairly large aquarium to be happy, but they're easy to raise.",
    "image": "/assets/quests/goldfish.jpg",
    "npc": "/assets/npc/vega.jpg",
    "start": "start",
    "dialogue": [
        {
            "id": "start",
            "text": "Hey there, I'm Vega. I hear you're interested in starting an aquarium. I have an idea: How about setting up a new home for a goldfish? It's a great start for budding aquarists.",
            "options": [
                {
                    "type": "goto",
                    "goto": "enthusiastic",
                    "text": "A goldfish? That sounds fun! Tell me more."
                },
                {
                    "type": "goto",
                    "goto": "skeptical",
                    "text": "A goldfish? I thought they were pretty basic."
                }
            ]
        },
        {
            "id": "enthusiastic",
            "text": "I'm glad you're excited! Goldfish might seem simple, but they're actually quite interesting. They need a fairly large tank and good water quality to thrive. I have a kit to help you get started.",
            "options": [
                {
                    "type": "goto",
                    "goto": "grant",
                    "text": "That sounds great, let's do this!"
                }
            ]
        },
        {
            "id": "skeptical",
            "text": "You'd be surprised! Goldfish are easy to care for, yes, but they also require some attention to detail. They need a decent-sized tank and good water quality. How about we get you set up with a starter kit?",
            "options": [
                {
                    "type": "goto",
                    "goto": "grant",
                    "text": "Alright, let's give it a shot."
                }
            ]
        },
        {
            "id": "grant",
            "text": "Perfect! I've got this starter kit for you. It includes a 20-gallon tank, a filter, and some food for your new pet.",
            "options": [
                {
                    "type": "grantsItems",
                    "grantsItems": [
                        {
                            "id": "0",
                            "count": 1
                        }
                    ],
                    "text": "I'll gladly take that!"
                },
                {
                    "type": "goto",
                    "goto": "setup",
                    "requiresItems": [
                        {
                            "id": "0",
                            "count": 1
                        }
                    ],
                    "text": "I've got the aquarium kit! What's next?"
                }
            ]
        },
        {
            "id": "setup",
            "text": "Great! Now, the first thing you need to do is set up the aquarium. Install the filter and fill the tank with water. Remember to condition the water before introducing the fish.",
            "options": [
                {
                    "type": "process",
                    "process": "setup-tank",
                    "text": "Alright, setting up the tank."
                },
                {
                    "type": "goto",
                    "goto": "introduce",
                    "text": "I've set up the tank and conditioned the water. What's next?"
                }
            ]
        },
        {
            "id": "introduce",
            "text": "Now gently introduce the goldfish into the tank. Remember, it's essential to acclimate the fish to the new water temperature by floating the bag in the tank for about 15 minutes before fully releasing it.",
            "options": [
                {
                    "type": "process",
                    "process": "introduce-fish",
                    "text": "Ok, introducing the goldfish now."
                },
                {
                    "type": "goto",
                    "goto": "finish",
                    "text": "I've introduced the goldfish into the tank. What's next?"
                }
            ]
        },
        {
            "id": "finish",
            "text": "That's it! You've done a great job setting up your new goldfish tank. Remember, goldfish are pretty hardy, but they still need regular feeding and tank cleaning. Let me know if you need any more help with your aquarium!",
            "options": [
                {
                    "type": "finish",
                    "text": "Thanks, Vega! I appreciate your help."
                }
            ]
        }    
    ],
    "rewards": [],
    "requiresQuests": []
}