{
    "id": "aquaria/goldfish",
    "title": "Set up an aquarium for a goldfish",
    "description": "Goldfish need a fairly large aquarium to be happy, but they're easy to raise.",
    "image": "/assets/quests/goldfish.jpg",
    "npc": "/assets/npc/vega.jpg",
    "start": "start",
    "dialogue": [
        {
            "id": "start",
            "text": "Hey there, I'm Vega. I'd love to teach you the basics of aquaria, if you're interested! I have a goldfish that needs a new home, and I'd love to help you get set up with the equipment you need!",
            "options": [
                {
                    "type": "goto",
                    "goto": "yes",
                    "text": "A goldfish? That sounds fun! Tell me more."
                }
            ]
        },
        {
            "id": "yes",
            "text": "Excellent! All you need is a nice surface to put this on. That stand in your garage looks perfect! I'm offering to supply you with all the necessary materials for a basic aquarium setup. You can always upgrade later, add more fish and plants, and so on. But this will get you started!",
            "options": [
                {
                    "type": "goto",
                    "goto": "maintenance",
                    "text": "I've always loved aquariums! Do they need a lot of maintenance?"
                }
            ]
        },
        {
            "id": "maintenance",
            "text": "A little bit of maintenance is certainly required, but if you schedule regular cleaning and monitoring tasks, it's not too bad! Tasks include cleaning the tank, monitoring the water parameters, and feeding the fish. With the right tools and a consistent schedule, these tasks become very manageable!",
            "options": [
                {
                    "type": "goto",
                    "goto": "setup",
                    "text": "Sounds good! Let's get started with the setup."
                }
            ]
        },
        {
            "id": "setup",
            "text": "Great! I'm giving you the following materials to get you started: a 150 Liter tank (for the fish to swim and grow), some gravel (for the tank bottom), a filter (to clean and purify the water), a heater (to keep the water at the right temperature), a light (to simulate day and night), a thermometer (to monitor the temperature), some fish food, and of course, the fish. These are the absolute basics you'll need, and as you become more comfortable, we'll want to add plants and decorations for the enjoyment of both you and the fish.",
            "options": [
                {
                    "type": "grantsItems",
                    "grantsItems": [
                        {
                            "id": "51",
                            "count": 1
                        },
                        {
                            "id": "25",
                            "count": 1
                        },
                        {
                            "id": "62",
                            "count": 20
                        },
                        {
                            "id": "55",
                            "count": 1
                        },
                        {
                            "id": "56",
                            "count": 1
                        },
                        {
                            "id": "57",
                            "count": 1
                        },
                        {
                            "id": "58",
                            "count": 1
                        },
                        {
                            "id": "63",
                            "count": 1
                        },
                        {
                            "id": "54",
                            "count": 1
                        },
                        {
                            "id": "53",
                            "count": 1
                        }
                    ],
                    "text": "Whoa, that's a lot of stuff! I hope I have the space..."
                },
                {
                    "type": "process",
                    "process": "prepare-aquarium",
                    "text": "Let's set this thing up! Can't wait to feed my fishie"
                },
                {
                    "type": "goto",
                    "goto": "fish",
                    "requiresItems": [
                        {
                            "id": "60",
                            "count": 1
                        }
                    ],
                    "text": "Aquarium is fully set up! Time to add the fish, right?"
                }
            ]
        },
        {
            "id": "fish",
            "text": "Yep, time to add the fish! Also you can feed your goldfish up to 3 times per day! Once your fish is in the tank, go ahead and feed it!",
            "options": [
                {
                    "type": "process",
                    "process": "add-goldfish",
                    "text": "Here you go, little buddy! Welcome to your new home!"
                },
                {
                    "type": "process",
                    "process": "feed-goldfish",
                    "text": "Wakey wakey, eggs and bakey! I hope you enjoy!"
                },
                {
                    "type": "finish",
                    "requiresItems": [
                        {
                            "id": "52",
                            "count": 1
                        }
                    ],
                    "text": "I'm so excited to have a fish! Thanks for all your help!"
                }
            ]
        }
    ],
    "rewards": [
        {
            "id": "65",
            "count": 1
        }
    ],
    "requiresQuests": [
        "welcome/howtodoquests"
    ]
}
